---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalNodeData
source: html/24e7600a-2ae0-f25c-c36a-62b5bfcdc2eb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalNodeData

This class holds information related to analytical model.

## Syntax (C#)
```csharp
public class AnalyticalNodeData : IDisposable
```

## Remarks
This class is attached to a ReferencePoint.